# Pandas Comparison with SQL
## <a href="https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html#comparison-with-sql">Reference</a>

In [1]:
import numpy as np
import pandas as pd

In [63]:
# Get data

url = (
    "https://raw.githubusercontent.com/pandas-dev"
    "/pandas/main/pandas/tests/io/data/csv/tips.csv"
)
tips = pd.read_csv(url)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## SELECT

SELECT total_bill, tip, smoker, time
FROM tips;

With pandas, column selection is done by passing a list of column names to your DataFrame

In [3]:
tips[["total_bill", "tip", "smoker", "time"]]

     total_bill   tip smoker    time
0         16.99  1.01     No  Dinner
1         10.34  1.66     No  Dinner
2         21.01  3.50     No  Dinner
3         23.68  3.31     No  Dinner
4         24.59  3.61     No  Dinner
..          ...   ...    ...     ...
239       29.03  5.92     No  Dinner
240       27.18  2.00    Yes  Dinner
241       22.67  2.00    Yes  Dinner
242       17.82  1.75     No  Dinner
243       18.78  3.00     No  Dinner

[244 rows x 4 columns]

SELECT *, tip/total_bill as tip_rate
FROM tips;

DataFrame.assgin()

In [4]:
tips.assign(tip_rate=tips["tip"] / tips["total_bill"])

     total_bill   tip     sex smoker   day    time  size  tip_rate
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

## WHERE

SELECT *
FROM tips
WHERE time = 'Dinner';

DataFrames can be filtered in multiple ways; the most intuitive of which is using boolean indexing.

In [10]:
is_dinner = tips["time"] == "Dinner"
display(is_dinner)
print(is_dinner.value_counts())

0      True
1      True
2      True
3      True
4      True
       ...
239    True
240    True
241    True
242    True
243    True
Name: time, Length: 244, dtype: bool

time
True     176
False     68
Name: count, dtype: int64

In [13]:
display(tips[is_dinner])
display(tips[tips["time"] == "Dinner"])
# Both lines return the same result

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[176 rows x 7 columns]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[176 rows x 7 columns]

SELECT *
FROM tips
WHERE time = 'Dinner' AND tip > 5.00;

In [14]:
tips[(tips["time"] == "Dinner") & (tips["tip"] > 5.00)]

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

SELECT *
FROM tips
WHERE size >= 5 OR total_bill > 45;

In [15]:
tips[(tips["size"] >= 5) | (tips["total_bill"] > 45)]

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
125       29.80   4.20  Female     No  Thur   Lunch     6
141       34.30   6.70    Male     No  Thur   Lunch     6
142       41.19   5.00    Male     No  Thur   Lunch     5
143       27.05   5.00  Female     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
185       20.69   5.00    Male     No   Sun  Dinner     5
187       30.46   2.00    Male    Yes   Sun  Dinner     5
212       48.33   9.00    Male     No   Sat  Dinner     4
216       28.15   3.00    Male    Yes   Sat  Dinner     5

### NULL checking is done using the notna() and isna() methods.

SELECT *
FROM frame
WHERE col2 IS NULL;

In [19]:
frame = pd.DataFrame(
    {"col1": ["A", "B", np.nan, "C", "D"], "col2": ["F", np.nan, "G", "H", "I"]}
)
display(frame)

frame[frame["col2"].isna()]

  col1 col2
0    A    F
1    B  NaN
2  NaN    G
3    C    H
4    D    I

  col1 col2
1    B  NaN

SELECT *
FROM frame
WHERE col1 IS NOT NULL;

In [20]:
frame = pd.DataFrame(
    {"col1": ["A", "B", np.nan, "C", "D"], "col2": ["F", np.nan, "G", "H", "I"]}
)
display(frame)

frame[frame["col1"].notna()]

  col1 col2
0    A    F
1    B  NaN
2  NaN    G
3    C    H
4    D    I

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

## GROUP BY

SELECT sex, count(*)
FROM tips
GROUP BY sex;
/*
Female     87
Male      157
*/

In [21]:
tips.groupby("sex").size()

sex
Female     87
Male      157
dtype: int64

In [24]:
 # DataFrameGroupBy.count()
# applies the function to 'each column',
# returning the number of NOT NULL records within each.

display(tips.groupby("sex").count())
display(tips.groupby("sex")["total_bill"].count()) # recommended

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

sex
Female     87
Male      157
Name: total_bill, dtype: int64

How tip amount differs by day of the week

SELECT day, AVG(tip), COUNT(*)
FROM tips
GROUP BY day;

/*
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thu  2.771452   62
*/

In [25]:
tips.groupby("day").agg({"tip": "mean", "day": "size"})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

SELECT smoker, day, COUNT(*), AVG(tip)
FROM tips
GROUP BY smoker, day;

In [26]:
tips.groupby(["smoker", "day"]).agg({"tip": ["size", "mean"]})

             tip
            size      mean
smoker day
No     Fri     4  2.812500
       Sat    45  3.102889
       Sun    57  3.167895
       Thur   45  2.673778
Yes    Fri    15  2.714000
       Sat    42  2.875476
       Sun    19  3.516842
       Thur   17  3.030000

## JOIN
JOINs can be performed with join() or merge().
By default, join() will join the DataFrames on their indices. Each method has parameters allowing you to specify the type of join to perform (LEFT, RIGHT, INNER, FULL) or the columns to join on (column names or indices).

In [29]:
df1 = pd.DataFrame({"key": ["A", "B", "C", "D"], "value": np.random.randn(4)})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value": np.random.randn(4)})

display(df1)
display(df2)

  key     value
0   A -2.265153
1   B -0.058137
2   C  0.104365
3   D  0.166507

  key     value
0   B -0.552899
1   D  0.243343
2   D -1.093422
3   E  0.799726

### INNER JOIN

SELECT *
FROM df1
INNER JOIN df2
  ON df1.key = df2.key;

In [30]:
# merge performs an INNER JOIN by default
pd.merge(df1, df2, on="key")

  key   value_x   value_y
0   B -0.058137 -0.552899
1   D  0.166507  0.243343
2   D  0.166507 -1.093422

In [31]:
# merge() also offers parameters for cases when you’d like to join
# one DataFrame’s column
# with another DataFrame’s index.

indexed_df2 = df2.set_index("key")
pd.merge(df1, indexed_df2, left_on="key", right_index=True)

  key   value_x   value_y
1   B -0.058137 -0.552899
3   D  0.166507  0.243343
3   D  0.166507 -1.093422

## LEFT OUTER JOIN

SELECT *
FROM df1
LEFT OUTER JOIN df2
  ON df1.key = df2.key;

In [32]:
pd.merge(df1, df2, on="key", how="left")

  key   value_x   value_y
0   A -2.265153       NaN
1   B -0.058137 -0.552899
2   C  0.104365       NaN
3   D  0.166507  0.243343
4   D  0.166507 -1.093422

## RIGHT OUTER JOIN

SELECT *
FROM df1
RIGHT OUTER JOIN df2
  ON df1.key = df2.key;

In [33]:
pd.merge(df1, df2, on="key", how="right")

  key   value_x   value_y
0   B -0.058137 -0.552899
1   D  0.166507  0.243343
2   D  0.166507 -1.093422
3   E       NaN  0.799726

## FULL JOIN

SELECT *
FROM df1
FULL OUTER JOIN df2
  ON df1.key = df2.key;

In [34]:
pd.merge(df1, df2, on="key", how="outer")

  key   value_x   value_y
0   A -2.265153       NaN
1   B -0.058137 -0.552899
2   C  0.104365       NaN
3   D  0.166507  0.243343
4   D  0.166507 -1.093422
5   E       NaN  0.799726

## UNION

In [35]:
df1 = pd.DataFrame(
    {"city": ["Chicago", "San Francisco", "New York City"], "rank": range(1, 4)}
)
df2 = pd.DataFrame(
    {"city": ["Chicago", "Boston", "Los Angeles"], "rank": [1, 4, 5]}
)

display(df1)
display(df2)

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

SELECT city, rank
FROM df1
UNION ALL
SELECT city, rank
FROM df2;

In [36]:
pd.concat([df1, df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

SQL’s UNION is similar to UNION ALL,
however UNION will remove duplicate rows.

SELECT city, rank
FROM df1
UNION
SELECT city, rank
FROM df2;

In [38]:
# notice that there is only one Chicago record this time

pd.concat([df1, df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

## LIMIT

SELECT * FROM tips
LIMIT 10;

In [39]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

### Top n rows with offset

-- MySQL
SELECT * FROM tips
ORDER BY tip DESC
LIMIT 10 OFFSET 5;

LIMIT 숫자 : 출력할 행의 수
OFFSET 숫자 : 몇번째 row부터 출력할 지. (1번째 row면 0)

In [44]:
# pandas.DataFrame.nlargest()
# := first n rows ordered by columns in descending order.
# columns : Column label(s) to order by.

tips.nlargest(5 + 10, columns="tip").tail(10)

     total_bill   tip     sex smoker   day    time  size
183       23.17  6.50    Male    Yes   Sun  Dinner     4
214       28.17  6.50  Female    Yes   Sat  Dinner     3
47        32.40  6.00    Male     No   Sun  Dinner     4
239       29.03  5.92    Male     No   Sat  Dinner     3
88        24.71  5.85    Male     No  Thur   Lunch     2
181       23.33  5.65    Male    Yes   Sun  Dinner     2
44        30.40  5.60    Male     No   Sun  Dinner     4
52        34.81  5.20  Female     No   Sun  Dinner     4
85        34.83  5.17  Female     No  Thur   Lunch     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4

### Top n rows per group

SELECT * FROM (
&emsp;SELECT
    &emsp;&emsp;t.*,
&emsp;&emsp;ROW_NUMBER() OVER(PARTITION BY day ORDER BY total_bill DESC) AS rn
&emsp;FROM tips t
)
WHERE rn < 3
ORDER BY day, rn;

-- Oracle's ROW_NUMBER() analytic function
ROW_NUMBER() OVER(PARTITION BY [그룹핑할 컬럼] ORDER BY [정렬할 컬럼])

In [54]:
(
    tips.assign(
        rn=tips.sort_values(["total_bill"], ascending=False)
        .groupby("day")
        .cumcount()
        + 1
    )
    .query("rn < 3")
    .sort_values(["day", "rn"])
)

# .cumcount() := Number each item in each group from 0 to the length of that group - 1.
# + 1 := R ROW_NUMBER() row index starts at 1 for the first row

     total_bill    tip     sex smoker   day    time  size  rn
95        40.17   4.73    Male    Yes   Fri  Dinner     4   1
90        28.97   3.00    Male    Yes   Fri  Dinner     2   2
170       50.81  10.00    Male    Yes   Sat  Dinner     3   1
212       48.33   9.00    Male     No   Sat  Dinner     4   2
156       48.17   5.00    Male     No   Sun  Dinner     6   1
182       45.35   3.50    Male    Yes   Sun  Dinner     3   2
197       43.11   5.00  Female    Yes  Thur   Lunch     4   1
142       41.19   5.00    Male     No  Thur   Lunch     5   2

In [55]:
(
    tips.assign(
        rnk=tips.groupby(["day"])["total_bill"].rank(
            method="first", ascending=False
        )
    )
    .query("rnk < 3")
    .sort_values(["day", "rnk"])
)

# pandas.DataFrame.rank()
# first: ranks assigned in order they appear in the array

     total_bill    tip     sex smoker   day    time  size  rnk
95        40.17   4.73    Male    Yes   Fri  Dinner     4  1.0
90        28.97   3.00    Male    Yes   Fri  Dinner     2  2.0
170       50.81  10.00    Male    Yes   Sat  Dinner     3  1.0
212       48.33   9.00    Male     No   Sat  Dinner     4  2.0
156       48.17   5.00    Male     No   Sun  Dinner     6  1.0
182       45.35   3.50    Male    Yes   Sun  Dinner     3  2.0
197       43.11   5.00  Female    Yes  Thur   Lunch     4  1.0
142       41.19   5.00    Male     No  Thur   Lunch     5  2.0

SELECT * FROM (
&emsp;  SELECT
&emsp;&emsp;    t.*,
&emsp;&emsp;    RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk
&emsp;  FROM tips t
&emsp;  WHERE tip < 2
)
WHERE rnk < 3
ORDER BY sex, rnk;


-- Oracle's RANK() analytic function
RANK() OVER(PARTITION BY [그룹핑할 컬럼] ORDER BY [정렬할 컬럼])

ROW_NUMBER() OVER(PARTITION BY [그룹핑할 컬럼] ORDER BY [정렬할 컬럼])와의 차이점
ROW_NUNBER() : 1등이 2명이어도 1, 2등으로 나눔
RANK() : 1등이 2명이면, 그 다음 순위는 3등으로 매김

In [57]:
(
    tips[tips["tip"] < 2]
    .assign(rnk_min=tips.groupby("sex")["tip"].rank(method="min"))
    .query("rnk_min < 3")
    .sort_values(["sex", "rnk_min"])
)

# pandas.DataFrame.rank()
# method="min"
# := lowest rank in the group

     total_bill   tip     sex smoker  day    time  size  rnk_min
67         3.07  1.00  Female    Yes  Sat  Dinner     1      1.0
92         5.75  1.00  Female    Yes  Fri  Dinner     2      1.0
111        7.25  1.00  Female     No  Sat  Dinner     1      1.0
236       12.60  1.00    Male    Yes  Sat  Dinner     2      1.0
237       32.83  1.17    Male    Yes  Sat  Dinner     2      2.0

## UPDATE

UPDATE tips
SET tip = tip*2
WHERE tip < 2;

In [64]:
display(tips.loc[tips["tip"] < 2, "tip"])

tips.loc[tips["tip"] < 2, "tip"] *= 2
display(tips)

0      1.01
1      1.66
8      1.96
10     1.71
12     1.57
16     1.67
30     1.45
43     1.32
53     1.56
57     1.50
58     1.76
62     1.98
67     1.00
70     1.97
75     1.25
82     1.83
92     1.00
97     1.50
99     1.50
105    1.64
111    1.00
117    1.50
118    1.80
121    1.68
126    1.48
130    1.50
132    1.50
135    1.25
145    1.50
146    1.36
147    1.63
148    1.73
168    1.61
190    1.50
195    1.44
215    1.10
217    1.50
218    1.44
222    1.92
224    1.58
233    1.47
235    1.25
236    1.00
237    1.17
242    1.75
Name: tip, dtype: float64

     total_bill   tip     sex smoker   day    time  size
0         16.99  2.02  Female     No   Sun  Dinner     2
1         10.34  3.32    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  3.50    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## DELETE

DELETE FROM tips
WHERE tip > 9;

In [66]:
tips = tips.loc[tips["tip"] <= 9, :]
display(tips)

     total_bill   tip     sex smoker   day    time  size
0         16.99  2.02  Female     No   Sun  Dinner     2
1         10.34  3.32    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  3.50    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[243 rows x 7 columns]